In [1]:
import numpy as np
import pandas as pd

In [7]:
employees = pd.DataFrame(
    {
        "emp_id": ["1001", "1002", "1003", "1004"],
        "first_name": ["John", "Mark", "Bob", "Alice"],
        "last_name": ["Smith", "Cook", "Cat", "Lee"],
        "dept_id": ["002", "001", "001", "005"],
    }
)

departments = pd.DataFrame(
    {
        "dept_id": ["001", "002", "003", "004"],
        "dept_name": ["IT", "Sales", "Marketing", "Support"],
    }
)

print(employees.merge(departments, on="dept_id", how="inner"))

  emp_id first_name last_name dept_id dept_name
0   1001       John     Smith     002     Sales
1   1002       Mark      Cook     001        IT
2   1003        Bob       Cat     001        IT

In [8]:
employees = pd.DataFrame(
    {
        "emp_id": ["1001", "1002", "1003", "1004"],
        "first_name": ["John", "Mark", "Bob", "Alice"],
        "last_name": ["Smith", "Cook", "Cat", "Lee"],
        "dept_id": ["002", "001", "001", "005"],
    }
)

departments = pd.DataFrame(
    {
        "dept_id": ["001", "002", "003", "004"],
        "dept_name": ["IT", "Sales", "Marketing", "Support"],
    }
)

print(employees.merge(departments, on="dept_id", how="left"))

  emp_id first_name last_name dept_id dept_name
0   1001       John     Smith     002     Sales
1   1002       Mark      Cook     001        IT
2   1003        Bob       Cat     001        IT
3   1004      Alice       Lee     005       NaN

In [9]:
employees = pd.DataFrame(
    {
        "emp_id": ["1001", "1002", "1003", "1004"],
        "first_name": ["John", "Mark", "Bob", "Alice"],
        "last_name": ["Smith", "Cook", "Cat", "Lee"],
        "dept_id": ["002", "001", "001", "005"],
    }
)

departments = pd.DataFrame(
    {
        "dept_id": ["001", "002", "003", "004"],
        "dept_name": ["IT", "Sales", "Marketing", "Support"],
    }
)

print(employees.merge(departments, on="dept_id", how="right"))

  emp_id first_name last_name dept_id  dept_name
0   1002       Mark      Cook     001         IT
1   1003        Bob       Cat     001         IT
2   1001       John     Smith     002      Sales
3    NaN        NaN       NaN     003  Marketing
4    NaN        NaN       NaN     004    Support

In [10]:
employees = pd.DataFrame(
    {
        "emp_id": ["1001", "1002", "1003", "1004"],
        "first_name": ["John", "Mark", "Bob", "Alice"],
        "last_name": ["Smith", "Cook", "Cat", "Lee"],
        "dept_id": ["002", "001", "001", "005"],
    }
)

departments = pd.DataFrame(
    {
        "dept_id": ["001", "002", "003", "004"],
        "dept_name": ["IT", "Sales", "Marketing", "Support"],
    }
)

print(employees.merge(departments, on="dept_id", how="outer"))

  emp_id first_name last_name dept_id  dept_name
0   1002       Mark      Cook     001         IT
1   1003        Bob       Cat     001         IT
2   1001       John     Smith     002      Sales
3    NaN        NaN       NaN     003  Marketing
4    NaN        NaN       NaN     004    Support
5   1004      Alice       Lee     005        NaN

In [11]:
import pandas as pd


employees = pd.DataFrame(
    {
        "emp_id": ["1001", "1002", "1003", "1003", "1004"],
        "first_name": ["John", "Mark", "Bob", "Bob", "Alice"],
        "last_name": ["Smith", "Cook", "Cat", "Cat", "Lee"],
        "dept_id": ["002", "001", "001", "001", "005"],
    }
)

departments = pd.DataFrame(
    {
        "dept_id": ["001", "002", "003", "004"],
        "dept_name": ["IT", "Sales", "Marketing", "Support"],
    }
)

employees.merge(departments, how="inner", on="dept_id")

  emp_id first_name last_name dept_id dept_name
0   1001       John     Smith     002     Sales
1   1002       Mark      Cook     001        IT
2   1003        Bob       Cat     001        IT
3   1003        Bob       Cat     001        IT

In [12]:
import pandas as pd


employees = pd.DataFrame(
    {
        "emp_id": ["1001", "1002", "1003", "1003", "1004"],
        "first_name": ["John", "Mark", "Bob", "Bob", "Alice"],
        "last_name": ["Smith", "Cook", "Cat", "Cat", "Lee"],
        "dept_id": ["002", "001", "001", "001", "005"],
    }
)

departments = pd.DataFrame(
    {
        "dept_id": ["001", "002", "003", "004"],
        "dept_name": ["IT", "Sales", "Marketing", "Support"],
    }
)

employees_unique = employees.drop_duplicates()
employees_unique.merge(departments, how="inner", on="dept_id")

  emp_id first_name last_name dept_id dept_name
0   1001       John     Smith     002     Sales
1   1002       Mark      Cook     001        IT
2   1003        Bob       Cat     001        IT

In [21]:
pd.set_option("display.max_columns", 30)
pd.set_option("display.width", 1000)
tips = pd.read_csv(
    "https://raw.githubusercontent.com/mwaskom/seaborn-data/" "master/tips.csv"
)

# print(pd.pivot_table(tips, index="day", values=["tip", "total_bill"], aggfunc="mean"))
print(tips.groupby("day")[["tip", "total_bill"]].mean())

           tip  total_bill
day
Fri   2.734737   17.151579
Sat   2.993103   20.441379
Sun   3.255132   21.410000
Thur  2.771452   17.682742

In [20]:
pd.set_option("display.max_columns", 30)
pd.set_option("display.width", 1000)
tips = pd.read_csv(
    "https://raw.githubusercontent.com/mwaskom/seaborn-data/" "master/tips.csv"
)
print(
    tips.pivot_table(index=["day", "sex"], values=["tip", "total_bill"], aggfunc="mean")
)

                  tip  total_bill
day  sex
Fri  Female  2.781111   14.145556
     Male    2.693000   19.857000
Sat  Female  2.801786   19.680357
     Male    3.083898   20.802542
Sun  Female  3.367222   19.872222
     Male    3.220345   21.887241
Thur Female  2.575625   16.715312
     Male    2.980333   18.714667

In [22]:
pd.set_option("display.max_columns", 30)
pd.set_option("display.width", 1000)
tips = pd.read_csv(
    "https://raw.githubusercontent.com/mwaskom/seaborn-data/" "master/tips.csv"
)
print(tips.pivot_table(index="day", values=["tip", "total_bill"], aggfunc="max"))

        tip  total_bill
day
Fri    4.73       40.17
Sat   10.00       50.81
Sun    6.50       48.17
Thur   6.70       43.11

In [23]:
pd.set_option("display.max_columns", 30)
pd.set_option("display.width", 1000)
tips = pd.read_csv(
    "https://raw.githubusercontent.com/mwaskom/seaborn-data/" "master/tips.csv"
)
print(
    tips.pivot_table(
        index=["day", "sex", "smoker"], values=["tip", "total_bill"], aggfunc="mean"
    )
)

                         tip  total_bill
day  sex    smoker
Fri  Female No      3.125000   19.365000
            Yes     2.682857   12.654286
     Male   No      2.500000   17.475000
            Yes     2.741250   20.452500
Sat  Female No      2.724615   19.003846
            Yes     2.868667   20.266667
     Male   No      3.256563   19.929063
            Yes     2.879259   21.837778
Sun  Female No      3.329286   20.824286
            Yes     3.500000   16.540000
     Male   No      3.115349   20.403256
            Yes     3.521333   26.141333
Thur Female No      2.459600   16.014400
            Yes     2.990000   19.218571
     Male   No      2.941500   18.486500
            Yes     3.058000   19.171000